import json
from datetime import datetime

# Тестовые данные JSON
json_data = '''
[
    {
        "name": "ДЮК II",
        "route": [
            {
                "port": 11,
                "coords": [
                    73.7,
                    68.5
                ],
                "port_name": "Новый порт",
                "date": "01-03-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-06-09 00:00:00",
                "time": 10000000
            },
            {
                "port": 15,
                "coords": [
                    57.8,
                    70.3
                ],
                "port_name": "Карские ворота",
                "date": "2022-09-17 00:00:00",
                "time": 10000000
            },
            {
                "port": 2,
                "coords": [
                    44.6,
                    69.9
                ],
                "port_name": "кромка льда на Западе",
                "date": "2022-09-17 18:02:22",
                "time": 18.039474459999997
            },
            {
                "port": 41,
                "coords": [
                    33.75,
                    69.5
                ],
                "port_name": "Рейд Мурманска",
                "date": "2022-09-18 09:11:16",
                "time": 15.148462026666648
            }
        ],
        "speed": 15,
        "date": "01-03-2022"
    },
    {
        "name": "САРМАТ",
        "route": [
            {
                "port": 25,
                "coords": [
                    72.15,
                    71.3
                ],
                "port_name": "Сабетта",
                "date": "02-03-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-06-10 00:00:00",
                "time": 10000000
            },
            {
                "port": 15,
                "coords": [
                    57.8,
                    70.3
                ],
                "port_name": "Карские ворота",
                "date": "2022-09-18 00:00:00",
                "time": 10000000
            },
            {
                "port": 2,
                "coords": [
                    44.6,
                    69.9
                ],
                "port_name": "кромка льда на Западе",
                "date": "2022-09-18 18:02:22",
                "time": 18.039474459999997
            },
            {
                "port": 29,
                "coords": [
                    40.05,
                    64.95
                ],
                "port_name": "Архангельск",
                "date": "2022-09-19 15:03:35",
                "time": 21.020317520000013
            }
        ],
        "speed": 15,
        "date": "02-03-2022"
    },
    {
        "name": "EDUARD TOLL",
        "route": [
            {
                "port": 25,
                "coords": [
                    72.15,
                    71.3
                ],
                "port_name": "Сабетта",
                "date": "04-03-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-03-05 03:41:49",
                "time": 27.697005428688872
            },
            {
                "port": 15,
                "coords": [
                    57.8,
                    70.3
                ],
                "port_name": "Карские ворота",
                "date": "2022-03-06 09:52:25",
                "time": 30.176902699377788
            },
            {
                "port": 2,
                "coords": [
                    44.6,
                    69.9
                ],
                "port_name": "кромка льда на Западе",
                "date": "2022-03-07 03:54:47",
                "time": 18.039474459999997
            },
            {
                "port": 41,
                "coords": [
                    33.75,
                    69.5
                ],
                "port_name": "Рейд Мурманска",
                "date": "2022-03-07 19:03:41",
                "time": 15.148462026666648
            }
        ],
        "speed": 15,
        "date": "04-03-2022"
    },
    {
        "name": "GEORGIY USHAKOV",
        "route": [
            {
                "port": 4,
                "coords": [
                    44.0,
                    73.0
                ],
                "port_name": "Штокман",
                "date": "07-03-2022",
                "time": 0
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-03-07 19:48:36",
                "time": 19.810053900000007
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-08 05:29:19",
                "time": 9.678842426666659
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2022-03-11 05:20:43",
                "time": 71.85684764999998
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2022-03-11 16:24:11",
                "time": 11.057807043653332
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2022-03-12 00:36:59",
                "time": 8.213561508480002
            },
            {
                "port": 12,
                "coords": [
                    116.0,
                    76.75
                ],
                "port_name": "Лаптевых - 1 (центр)",
                "date": "2022-03-12 16:12:33",
                "time": 15.593032691200001
            },
            {
                "port": 42,
                "coords": [
                    140.8,
                    76.7
                ],
                "port_name": "остров Котельный",
                "date": "2022-03-18 19:49:26",
                "time": 147.614762628889
            },
            {
                "port": 30,
                "coords": [
                    152.6,
                    75.9
                ],
                "port_name": "Лаптевых - 3 (восток)",
                "date": "2022-03-19 21:35:42",
                "time": 25.771215155000032
            },
            {
                "port": 18,
                "coords": [
                    170.5,
                    70.7
                ],
                "port_name": "Восточно-Сибирское 1",
                "date": "2022-03-27 23:29:36",
                "time": 193.89852946666625
            },
            {
                "port": 27,
                "coords": [
                    179.0,
                    69.9
                ],
                "port_name": "Пролив Лонга",
                "date": "2022-03-31 03:19:06",
                "time": 75.82505264888896
            }
        ],
        "speed": 15,
        "date": "07-03-2022"
    },
    {
        "name": "RUDOLF SAMOYLOVICH",
        "route": [
            {
                "port": 11,
                "coords": [
                    73.7,
                    68.5
                ],
                "port_name": "Новый порт",
                "date": "08-03-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-03-12 02:14:54",
                "time": 98.24839753299993
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-13 16:33:50",
                "time": 38.31558502466666
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2022-03-16 16:25:14",
                "time": 71.85684764999998
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2022-03-17 03:28:42",
                "time": 11.057807043653332
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2022-03-17 11:41:30",
                "time": 8.213561508480002
            },
            {
                "port": 9,
                "coords": [
                    116.7,
                    74.9
                ],
                "port_name": "Лаптевых - 4 (юг)",
                "date": "2022-03-19 04:46:54",
                "time": 41.090029542333355
            },
            {
                "port": 24,
                "coords": [
                    128.1,
                    74.0
                ],
                "port_name": "устье Лены",
                "date": "2022-03-19 22:27:09",
                "time": 17.67099690026667
            }
        ],
        "speed": 15,
        "date": "08-03-2022"
    },
    {
        "name": "VLADIMIR VORONIN",
        "route": [
            {
                "port": 25,
                "coords": [
                    72.15,
                    71.3
                ],
                "port_name": "Сабетта",
                "date": "12-03-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-03-13 03:41:49",
                "time": 27.697005428688872
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-14 18:00:45",
                "time": 38.31558502466666
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2022-03-17 17:52:09",
                "time": 71.85684764999998
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2022-03-18 04:55:37",
                "time": 11.057807043653332
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2022-03-18 13:08:25",
                "time": 8.213561508480002
            },
            {
                "port": 12,
                "coords": [
                    116.0,
                    76.75
                ],
                "port_name": "Лаптевых - 1 (центр)",
                "date": "2022-03-19 04:43:59",
                "time": 15.593032691200001
            },
            {
                "port": 42,
                "coords": [
                    140.8,
                    76.7
                ],
                "port_name": "остров Котельный",
                "date": "2022-03-25 08:20:52",
                "time": 147.614762628889
            },
            {
                "port": 30,
                "coords": [
                    152.6,
                    75.9
                ],
                "port_name": "Лаптевых - 3 (восток)",
                "date": "2022-03-26 10:07:08",
                "time": 25.771215155000032
            },
            {
                "port": 18,
                "coords": [
                    170.5,
                    70.7
                ],
                "port_name": "Восточно-Сибирское 1",
                "date": "2022-04-03 12:01:02",
                "time": 193.89852946666625
            },
            {
                "port": 27,
                "coords": [
                    179.0,
                    69.9
                ],
                "port_name": "Пролив Лонга",
                "date": "2022-04-06 15:50:32",
                "time": 75.82505264888896
            }
        ],
        "speed": 15,
        "date": "12-03-2022"
    },
    {
        "name": "NIKOLAY YEVGENOV",
        "route": [
            {
                "port": 35,
                "coords": [
                    73.73,
                    71.0
                ],
                "port_name": "Терминал Утренний",
                "date": "13-03-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-03-14 14:57:54",
                "time": 38.96505415600003
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-16 08:01:02",
                "time": 41.05241252642856
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2022-03-19 13:00:24",
                "time": 76.98947962499997
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2022-03-20 00:51:15",
                "time": 11.847650403914285
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2022-03-20 09:39:15",
                "time": 8.80024447337143
            },
            {
                "port": 12,
                "coords": [
                    116.0,
                    76.75
                ],
                "port_name": "Лаптевых - 1 (центр)",
                "date": "2022-03-21 02:21:39",
                "time": 16.70682074057143
            },
            {
                "port": 42,
                "coords": [
                    140.8,
                    76.7
                ],
                "port_name": "остров Котельный",
                "date": "2022-03-27 16:31:10",
                "time": 158.15867424523822
            },
            {
                "port": 30,
                "coords": [
                    152.6,
                    75.9
                ],
                "port_name": "Лаптевых - 3 (восток)",
                "date": "2022-03-28 20:07:53",
                "time": 27.612016237500033
            },
            {
                "port": 18,
                "coords": [
                    170.5,
                    70.7
                ],
                "port_name": "Восточно-Сибирское 1",
                "date": "2022-04-06 11:52:47",
                "time": 207.74842442857098
            },
            {
                "port": 27,
                "coords": [
                    179.0,
                    69.9
                ],
                "port_name": "Пролив Лонга",
                "date": "2022-04-09 21:07:15",
                "time": 81.24112783809531
            }
        ],
        "speed": 14,
        "date": "13-03-2022"
    },
    {
        "name": "CHRISTOPHE DE MARGERIE",
        "route": [
            {
                "port": 5,
                "coords": [
                    22.0,
                    71.5
                ],
                "port_name": "Окно в Европу",
                "date": "07-03-2022",
                "time": 0
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-03-08 22:48:40",
                "time": 46.811124099999915
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-09 09:10:52",
                "time": 10.370188314285707
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-03-11 02:14:00",
                "time": 41.05241252642856
            },
            {
                "port": 35,
                "coords": [
                    73.73,
                    71.0
                ],
                "port_name": "Терминал Утренний",
                "date": "2022-03-12 17:11:54",
                "time": 38.96505415600003
            }
        ],
        "speed": 14,
        "date": "07-03-2022"
    },
    {
        "name": "BORIS VILKITSKY",
        "route": [
            {
                "port": 5,
                "coords": [
                    22.0,
                    71.5
                ],
                "port_name": "Окно в Европу",
                "date": "07-03-2022",
                "time": 0
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-03-08 10:29:32",
                "time": 34.49240723157889
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-08 18:08:00",
                "time": 7.641191389473678
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-03-10 00:22:56",
                "time": 30.24914607210526
            },
            {
                "port": 35,
                "coords": [
                    73.73,
                    71.0
                ],
                "port_name": "Терминал Утренний",
                "date": "2022-03-11 05:05:35",
                "time": 28.711092536000024
            }
        ],
        "speed": 19,
        "date": "07-03-2022"
    },
    {
        "name": "АРКТИКА-2",
        "route": [
            {
                "port": 35,
                "coords": [
                    73.73,
                    71.0
                ],
                "port_name": "Терминал Утренний",
                "date": "15-03-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-06-23 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-10-01 00:00:00",
                "time": 10000000
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2023-01-09 00:00:00",
                "time": 10000000
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2023-04-19 00:00:00",
                "time": 10000000
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2023-07-28 00:00:00",
                "time": 10000000
            },
            {
                "port": 9,
                "coords": [
                    116.7,
                    74.9
                ],
                "port_name": "Лаптевых - 4 (юг)",
                "date": "2023-11-05 00:00:00",
                "time": 10000000
            },
            {
                "port": 24,
                "coords": [
                    128.1,
                    74.0
                ],
                "port_name": "устье Лены",
                "date": "2024-02-13 00:00:00",
                "time": 10000000
            }
        ],
        "speed": 19,
        "date": "15-03-2022"
    },
    {
        "name": "ИНЖЕНЕР ВЕШНЯКОВ",
        "route": [
            {
                "port": 5,
                "coords": [
                    22.0,
                    71.5
                ],
                "port_name": "Окно в Европу",
                "date": "09-03-2022",
                "time": 0
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-03-10 10:29:32",
                "time": 34.49240723157889
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-10 18:08:00",
                "time": 7.641191389473678
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-06-18 18:08:00",
                "time": 10000000
            },
            {
                "port": 35,
                "coords": [
                    73.73,
                    71.0
                ],
                "port_name": "Терминал Утренний",
                "date": "2022-09-26 18:08:00",
                "time": 10000000
            }
        ],
        "speed": 19,
        "date": "09-03-2022"
    },
    {
        "name": "ТАМБЕЙ",
        "route": [
            {
                "port": 5,
                "coords": [
                    22.0,
                    71.5
                ],
                "port_name": "Окно в Европу",
                "date": "16-03-2022",
                "time": 0
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-03-17 10:29:32",
                "time": 34.49240723157889
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-17 18:08:00",
                "time": 7.641191389473678
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-06-25 18:08:00",
                "time": 10000000
            },
            {
                "port": 35,
                "coords": [
                    73.73,
                    71.0
                ],
                "port_name": "Терминал Утренний",
                "date": "2022-10-03 18:08:00",
                "time": 10000000
            }
        ],
        "speed": 19,
        "date": "16-03-2022"
    },
    {
        "name": "ШТУРМАН АЛЬБАНОВ",
        "route": [
            {
                "port": 4,
                "coords": [
                    44.0,
                    73.0
                ],
                "port_name": "Штокман",
                "date": "26-03-2022",
                "time": 0
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-03-26 15:38:22",
                "time": 15.63951623684211
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-26 23:16:50",
                "time": 7.641191389473678
            },
            {
                "port": 13,
                "coords": [
                    76.7,
                    74.0
                ],
                "port_name": "Карское - 1 (сбор каравана)",
                "date": "2022-03-28 05:14:33",
                "time": 29.962136276754403
            },
            {
                "port": 0,
                "coords": [
                    80.0,
                    73.1
                ],
                "port_name": "Бухта Север и Диксон",
                "date": "2022-03-28 09:51:56",
                "time": 4.6231261855087755
            },
            {
                "port": 1,
                "coords": [
                    86.15,
                    69.4
                ],
                "port_name": "Дудинка",
                "date": "2022-03-30 03:08:08",
                "time": 41.270127045578924
            }
        ],
        "speed": 19,
        "date": "26-03-2022"
    },
    {
        "name": "НИКИФОР БЕГИЧЕВ",
        "route": [
            {
                "port": 11,
                "coords": [
                    73.7,
                    68.5
                ],
                "port_name": "Новый порт",
                "date": "10-03-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-06-18 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-09-26 00:00:00",
                "time": 10000000
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-09-26 09:04:26",
                "time": 9.073914774999993
            },
            {
                "port": 5,
                "coords": [
                    22.0,
                    71.5
                ],
                "port_name": "Окно в Европу",
                "date": "2022-09-28 02:02:01",
                "time": 40.959733587499926
            }
        ],
        "speed": 16,
        "date": "10-03-2022"
    },
    {
        "name": "НОРИЛЬСКИЙ НИКЕЛЬ",
        "route": [
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "13-03-2022",
                "time": 0
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2022-03-16 04:59:22",
                "time": 76.98947962499997
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2022-03-16 16:50:13",
                "time": 11.847650403914285
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2022-03-17 01:38:13",
                "time": 8.80024447337143
            },
            {
                "port": 9,
                "coords": [
                    116.7,
                    74.9
                ],
                "port_name": "Лаптевых - 4 (юг)",
                "date": "2022-03-18 21:39:43",
                "time": 44.025031652500026
            },
            {
                "port": 24,
                "coords": [
                    128.1,
                    74.0
                ],
                "port_name": "устье Лены",
                "date": "2022-03-19 16:35:42",
                "time": 18.93321096457143
            }
        ],
        "speed": 14,
        "date": "13-03-2022"
    },
    {
        "name": "АЙС ИГЛ",
        "route": [
            {
                "port": 11,
                "coords": [
                    73.7,
                    68.5
                ],
                "port_name": "Новый порт",
                "date": "24-03-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-07-02 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-10-10 00:00:00",
                "time": 10000000
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-10-10 10:22:12",
                "time": 10.370188314285707
            },
            {
                "port": 4,
                "coords": [
                    44.0,
                    73.0
                ],
                "port_name": "Штокман",
                "date": "2022-10-11 07:35:42",
                "time": 21.22505775000001
            }
        ],
        "speed": 14,
        "date": "24-03-2022"
    },
    {
        "name": "ШТУРМАН КОШЕЛЕВ",
        "route": [
            {
                "port": 27,
                "coords": [
                    179.0,
                    69.9
                ],
                "port_name": "Пролив Лонга",
                "date": "04-03-2022",
                "time": 0
            },
            {
                "port": 18,
                "coords": [
                    170.5,
                    70.7
                ],
                "port_name": "Восточно-Сибирское 1",
                "date": "2022-03-07 03:49:30",
                "time": 75.82505264888896
            },
            {
                "port": 30,
                "coords": [
                    152.6,
                    75.9
                ],
                "port_name": "Лаптевых - 3 (восток)",
                "date": "2022-03-15 05:43:24",
                "time": 193.89852946666625
            },
            {
                "port": 42,
                "coords": [
                    140.8,
                    76.7
                ],
                "port_name": "остров Котельный",
                "date": "2022-03-16 07:29:40",
                "time": 25.771215155000032
            },
            {
                "port": 12,
                "coords": [
                    116.0,
                    76.75
                ],
                "port_name": "Лаптевых - 1 (центр)",
                "date": "2022-03-22 11:06:33",
                "time": 147.614762628889
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2022-03-23 02:42:07",
                "time": 15.593032691200001
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2022-03-23 10:54:55",
                "time": 8.213561508480002
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2022-03-23 21:58:23",
                "time": 11.057807043653332
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-26 21:49:47",
                "time": 71.85684764999998
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-03-28 12:08:43",
                "time": 38.31558502466666
            },
            {
                "port": 25,
                "coords": [
                    72.15,
                    71.3
                ],
                "port_name": "Сабетта",
                "date": "2022-03-29 15:50:32",
                "time": 27.697005428688872
            }
        ],
        "speed": 15,
        "date": "04-03-2022"
    },
    {
        "name": "ШТУРМАН ЩЕРБИНИН",
        "route": [
            {
                "port": 6,
                "coords": [
                    63.9,
                    74.6
                ],
                "port_name": "Победа месторождение",
                "date": "19-03-2022",
                "time": 0
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-19 14:46:47",
                "time": 14.779973083733342
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-03-20 00:27:30",
                "time": 9.678842426666659
            },
            {
                "port": 5,
                "coords": [
                    22.0,
                    71.5
                ],
                "port_name": "Окно в Европу",
                "date": "2022-03-21 20:08:55",
                "time": 43.69038249333325
            }
        ],
        "speed": 15,
        "date": "19-03-2022"
    },
    {
        "name": "ШТУРМАН СКУРАТОВ",
        "route": [
            {
                "port": 35,
                "coords": [
                    73.73,
                    71.0
                ],
                "port_name": "Терминал Утренний",
                "date": "19-03-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-03-20 12:22:02",
                "time": 36.36738387893336
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-03-22 02:40:58",
                "time": 38.31558502466666
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2022-03-25 02:32:22",
                "time": 71.85684764999998
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2022-03-25 13:35:50",
                "time": 11.057807043653332
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2022-03-25 21:48:38",
                "time": 8.213561508480002
            },
            {
                "port": 9,
                "coords": [
                    116.7,
                    74.9
                ],
                "port_name": "Лаптевых - 4 (юг)",
                "date": "2022-03-27 14:54:02",
                "time": 41.090029542333355
            },
            {
                "port": 24,
                "coords": [
                    128.1,
                    74.0
                ],
                "port_name": "устье Лены",
                "date": "2022-03-28 08:34:17",
                "time": 17.67099690026667
            }
        ],
        "speed": 15,
        "date": "19-03-2022"
    },
    {
        "name": "ИОГАНН МАХМАСТАЛЬ",
        "route": [
            {
                "port": 11,
                "coords": [
                    73.7,
                    68.5
                ],
                "port_name": "Новый порт",
                "date": "17-03-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-06-25 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-10-03 00:00:00",
                "time": 10000000
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-10-03 10:22:12",
                "time": 10.370188314285707
            },
            {
                "port": 5,
                "coords": [
                    22.0,
                    71.5
                ],
                "port_name": "Окно в Европу",
                "date": "2022-10-05 09:10:52",
                "time": 46.811124099999915
            }
        ],
        "speed": 14,
        "date": "17-03-2022"
    },
    {
        "name": "BORIS SOKOLOV",
        "route": [
            {
                "port": 29,
                "coords": [
                    40.05,
                    64.95
                ],
                "port_name": "Архангельск",
                "date": "24-03-2022",
                "time": 0
            },
            {
                "port": 2,
                "coords": [
                    44.6,
                    69.9
                ],
                "port_name": "кромка льда на Западе",
                "date": "2022-03-24 22:31:18",
                "time": 22.521768771428587
            },
            {
                "port": 15,
                "coords": [
                    57.8,
                    70.3
                ],
                "port_name": "Карские ворота",
                "date": "2022-03-25 17:50:58",
                "time": 19.328008349999998
            },
            {
                "port": 13,
                "coords": [
                    76.7,
                    74.0
                ],
                "port_name": "Карское - 1 (сбор каравана)",
                "date": "2022-03-27 07:57:47",
                "time": 38.113671003571405
            },
            {
                "port": 0,
                "coords": [
                    80.0,
                    73.1
                ],
                "port_name": "Бухта Север и Диксон",
                "date": "2022-03-27 14:14:14",
                "time": 6.274242680333338
            },
            {
                "port": 1,
                "coords": [
                    86.15,
                    69.4
                ],
                "port_name": "Дудинка",
                "date": "2022-03-29 22:14:48",
                "time": 56.00945813328568
            }
        ],
        "speed": 14,
        "date": "24-03-2022"
    },
    {
        "name": "ИНЖЕНЕР ТРУБИН",
        "route": [
            {
                "port": 24,
                "coords": [
                    128.1,
                    74.0
                ],
                "port_name": "устье Лены",
                "date": "08-03-2022",
                "time": 0
            },
            {
                "port": 9,
                "coords": [
                    116.7,
                    74.9
                ],
                "port_name": "Лаптевых - 4 (юг)",
                "date": "2022-06-16 00:00:00",
                "time": 10000000
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2022-09-24 00:00:00",
                "time": 10000000
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2023-01-02 00:00:00",
                "time": 10000000
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2023-04-12 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2023-07-21 00:00:00",
                "time": 10000000
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2023-10-29 00:00:00",
                "time": 10000000
            },
            {
                "port": 11,
                "coords": [
                    73.7,
                    68.5
                ],
                "port_name": "Новый порт",
                "date": "2024-02-06 00:00:00",
                "time": 10000000
            }
        ],
        "speed": 12,
        "date": "08-03-2022"
    },
    {
        "name": "БАРЕНЦ",
        "route": [
            {
                "port": 18,
                "coords": [
                    170.5,
                    70.7
                ],
                "port_name": "Восточно-Сибирское 1",
                "date": "20-03-2022",
                "time": 0
            },
            {
                "port": 30,
                "coords": [
                    152.6,
                    75.9
                ],
                "port_name": "Лаптевых - 3 (восток)",
                "date": "2022-06-28 00:00:00",
                "time": 10000000
            },
            {
                "port": 42,
                "coords": [
                    140.8,
                    76.7
                ],
                "port_name": "остров Котельный",
                "date": "2022-10-06 00:00:00",
                "time": 10000000
            },
            {
                "port": 12,
                "coords": [
                    116.0,
                    76.75
                ],
                "port_name": "Лаптевых - 1 (центр)",
                "date": "2023-01-14 00:00:00",
                "time": 10000000
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2023-04-24 00:00:00",
                "time": 10000000
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2023-08-02 00:00:00",
                "time": 10000000
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2023-11-10 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2024-02-18 00:00:00",
                "time": 10000000
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2024-02-18 09:04:26",
                "time": 9.073914774999993
            },
            {
                "port": 4,
                "coords": [
                    44.0,
                    73.0
                ],
                "port_name": "Штокман",
                "date": "2024-02-19 03:38:44",
                "time": 18.571925531250006
            },
            {
                "port": 41,
                "coords": [
                    33.75,
                    69.5
                ],
                "port_name": "Рейд Мурманска",
                "date": "2024-02-19 21:39:27",
                "time": 18.011994843750013
            }
        ],
        "speed": 16,
        "date": "20-03-2022"
    },
    {
        "name": "ПОЛАР КИНГ",
        "route": [
            {
                "port": 28,
                "coords": [
                    169.9,
                    73.5
                ],
                "port_name": "Восточно-Сибирское 3",
                "date": "16-03-2022",
                "time": 0
            },
            {
                "port": 30,
                "coords": [
                    152.6,
                    75.9
                ],
                "port_name": "Лаптевых - 3 (восток)",
                "date": "2022-06-24 00:00:00",
                "time": 10000000
            },
            {
                "port": 42,
                "coords": [
                    140.8,
                    76.7
                ],
                "port_name": "остров Котельный",
                "date": "2022-10-02 00:00:00",
                "time": 10000000
            },
            {
                "port": 12,
                "coords": [
                    116.0,
                    76.75
                ],
                "port_name": "Лаптевых - 1 (центр)",
                "date": "2023-01-10 00:00:00",
                "time": 10000000
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2023-04-20 00:00:00",
                "time": 10000000
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2023-07-29 00:00:00",
                "time": 10000000
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2023-11-06 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2024-02-14 00:00:00",
                "time": 10000000
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2024-02-14 09:04:26",
                "time": 9.073914774999993
            },
            {
                "port": 2,
                "coords": [
                    44.6,
                    69.9
                ],
                "port_name": "кромка льда на Западе",
                "date": "2024-02-15 12:56:39",
                "time": 27.870508637499924
            },
            {
                "port": 29,
                "coords": [
                    40.05,
                    64.95
                ],
                "port_name": "Архангельск",
                "date": "2024-02-16 08:39:02",
                "time": 19.706547675000014
            }
        ],
        "speed": 16,
        "date": "16-03-2022"
    },
    {
        "name": "МЫС ДЕЖНЕВА",
        "route": [
            {
                "port": 6,
                "coords": [
                    63.9,
                    74.6
                ],
                "port_name": "Победа месторождение",
                "date": "01-04-2022",
                "time": 0
            },
            {
                "port": 7,
                "coords": [
                    86.4,
                    76.4
                ],
                "port_name": "Карское - 3 (центр)",
                "date": "2022-07-10 00:00:00",
                "time": 10000000
            },
            {
                "port": 13,
                "coords": [
                    76.7,
                    74.0
                ],
                "port_name": "Карское - 1 (сбор каравана)",
                "date": "2022-10-18 00:00:00",
                "time": 10000000
            },
            {
                "port": 0,
                "coords": [
                    80.0,
                    73.1
                ],
                "port_name": "Бухта Север и Диксон",
                "date": "2023-01-26 00:00:00",
                "time": 10000000
            },
            {
                "port": 1,
                "coords": [
                    86.15,
                    69.4
                ],
                "port_name": "Дудинка",
                "date": "2023-05-06 00:00:00",
                "time": 10000000
            }
        ],
        "speed": 16,
        "date": "01-04-2022"
    },
    {
        "name": "СЕВМОРПУТЬ",
        "route": [
            {
                "port": 4,
                "coords": [
                    44.0,
                    73.0
                ],
                "port_name": "Штокман",
                "date": "08-04-2022",
                "time": 0
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-04-08 21:13:30",
                "time": 21.22505775000001
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-04-09 07:35:42",
                "time": 10.370188314285707
            },
            {
                "port": 13,
                "coords": [
                    76.7,
                    74.0
                ],
                "port_name": "Карское - 1 (сбор каравана)",
                "date": "2022-07-18 07:35:42",
                "time": 10000000
            },
            {
                "port": 0,
                "coords": [
                    80.0,
                    73.1
                ],
                "port_name": "Бухта Север и Диксон",
                "date": "2022-10-26 07:35:42",
                "time": 10000000
            },
            {
                "port": 1,
                "coords": [
                    86.15,
                    69.4
                ],
                "port_name": "Дудинка",
                "date": "2023-02-03 07:35:42",
                "time": 10000000
            }
        ],
        "speed": 14,
        "date": "08-04-2022"
    },
    {
        "name": "ГРИГОРИЙ ШЕЛИХОВ",
        "route": [
            {
                "port": 11,
                "coords": [
                    73.7,
                    68.5
                ],
                "port_name": "Новый порт",
                "date": "10-04-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-07-19 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-10-27 00:00:00",
                "time": 10000000
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2023-02-04 00:00:00",
                "time": 10000000
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2023-05-15 00:00:00",
                "time": 10000000
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2023-08-23 00:00:00",
                "time": 10000000
            },
            {
                "port": 9,
                "coords": [
                    116.7,
                    74.9
                ],
                "port_name": "Лаптевых - 4 (юг)",
                "date": "2023-12-01 00:00:00",
                "time": 10000000
            },
            {
                "port": 24,
                "coords": [
                    128.1,
                    74.0
                ],
                "port_name": "устье Лены",
                "date": "2024-03-10 00:00:00",
                "time": 10000000
            }
        ],
        "speed": 14,
        "date": "10-04-2022"
    },
    {
        "name": "УРАРТУ",
        "route": [
            {
                "port": 29,
                "coords": [
                    40.05,
                    64.95
                ],
                "port_name": "Архангельск",
                "date": "07-04-2022",
                "time": 0
            },
            {
                "port": 2,
                "coords": [
                    44.6,
                    69.9
                ],
                "port_name": "кромка льда на Западе",
                "date": "2022-04-07 17:31:00",
                "time": 17.516931266666678
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-04-08 18:17:25",
                "time": 24.773785455555487
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-04-09 02:21:21",
                "time": 8.065702022222217
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2022-07-18 02:21:21",
                "time": 10000000
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2022-10-26 02:21:21",
                "time": 10000000
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2023-02-03 02:21:21",
                "time": 10000000
            },
            {
                "port": 9,
                "coords": [
                    116.7,
                    74.9
                ],
                "port_name": "Лаптевых - 4 (юг)",
                "date": "2023-05-14 02:21:21",
                "time": 10000000
            },
            {
                "port": 24,
                "coords": [
                    128.1,
                    74.0
                ],
                "port_name": "устье Лены",
                "date": "2023-08-22 02:21:21",
                "time": 10000000
            }
        ],
        "speed": 18,
        "date": "07-04-2022"
    },
    {
        "name": "ФЕСКО ПАРИС",
        "route": [
            {
                "port": 35,
                "coords": [
                    73.73,
                    71.0
                ],
                "port_name": "Терминал Утренний",
                "date": "15-04-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-07-24 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-11-01 00:00:00",
                "time": 10000000
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2023-02-09 00:00:00",
                "time": 10000000
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2023-05-20 00:00:00",
                "time": 10000000
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2023-08-28 00:00:00",
                "time": 10000000
            },
            {
                "port": 12,
                "coords": [
                    116.0,
                    76.75
                ],
                "port_name": "Лаптевых - 1 (центр)",
                "date": "2023-12-06 00:00:00",
                "time": 10000000
            },
            {
                "port": 42,
                "coords": [
                    140.8,
                    76.7
                ],
                "port_name": "остров Котельный",
                "date": "2024-03-15 00:00:00",
                "time": 10000000
            },
            {
                "port": 30,
                "coords": [
                    152.6,
                    75.9
                ],
                "port_name": "Лаптевых - 3 (восток)",
                "date": "2024-06-23 00:00:00",
                "time": 10000000
            },
            {
                "port": 18,
                "coords": [
                    170.5,
                    70.7
                ],
                "port_name": "Восточно-Сибирское 1",
                "date": "2024-10-01 00:00:00",
                "time": 10000000
            },
            {
                "port": 27,
                "coords": [
                    179.0,
                    69.9
                ],
                "port_name": "Пролив Лонга",
                "date": "2025-01-09 00:00:00",
                "time": 10000000
            }
        ],
        "speed": 18,
        "date": "15-04-2022"
    },
    {
        "name": "ПРОГРЕСС",
        "route": [
            {
                "port": 4,
                "coords": [
                    44.0,
                    73.0
                ],
                "port_name": "Штокман",
                "date": "16-04-2022",
                "time": 0
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-04-16 16:30:30",
                "time": 16.508378250000007
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-04-17 00:34:26",
                "time": 8.065702022222217
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-07-26 00:34:26",
                "time": 10000000
            },
            {
                "port": 35,
                "coords": [
                    73.73,
                    71.0
                ],
                "port_name": "Терминал Утренний",
                "date": "2022-11-03 00:34:26",
                "time": 10000000
            }
        ],
        "speed": 18,
        "date": "16-04-2022"
    },
    {
        "name": "МИХАИЛ БРИТНЕВ",
        "route": [
            {
                "port": 41,
                "coords": [
                    33.75,
                    69.5
                ],
                "port_name": "Рейд Мурманска",
                "date": "16-04-2022",
                "time": 0
            },
            {
                "port": 2,
                "coords": [
                    44.6,
                    69.9
                ],
                "port_name": "кромка льда на Западе",
                "date": "2022-04-16 12:37:25",
                "time": 12.62371835555554
            },
            {
                "port": 15,
                "coords": [
                    57.8,
                    70.3
                ],
                "port_name": "Карские ворота",
                "date": "2022-04-17 03:39:23",
                "time": 15.032895383333331
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-07-26 03:39:23",
                "time": 10000000
            },
            {
                "port": 11,
                "coords": [
                    73.7,
                    68.5
                ],
                "port_name": "Новый порт",
                "date": "2022-11-03 03:39:23",
                "time": 10000000
            }
        ],
        "speed": 18,
        "date": "16-04-2022"
    },
    {
        "name": "САБЕТТА",
        "route": [
            {
                "port": 44,
                "coords": [
                    47.82,
                    67.58
                ],
                "port_name": "Индига",
                "date": "16-04-2022",
                "time": 0
            },
            {
                "port": 15,
                "coords": [
                    57.8,
                    70.3
                ],
                "port_name": "Карские ворота",
                "date": "2022-07-25 00:00:00",
                "time": 10000000
            },
            {
                "port": 6,
                "coords": [
                    63.9,
                    74.6
                ],
                "port_name": "Победа месторождение",
                "date": "2022-11-02 00:00:00",
                "time": 10000000
            }
        ],
        "speed": 16,
        "date": "16-04-2022"
    },
    {
        "name": "ГЕОРГИЙ УШАКОВ",
        "route": [
            {
                "port": 27,
                "coords": [
                    179.0,
                    69.9
                ],
                "port_name": "Пролив Лонга",
                "date": "06-04-2022",
                "time": 0
            },
            {
                "port": 18,
                "coords": [
                    170.5,
                    70.7
                ],
                "port_name": "Восточно-Сибирское 1",
                "date": "2022-07-15 00:00:00",
                "time": 10000000
            },
            {
                "port": 30,
                "coords": [
                    152.6,
                    75.9
                ],
                "port_name": "Лаптевых - 3 (восток)",
                "date": "2022-10-23 00:00:00",
                "time": 10000000
            },
            {
                "port": 42,
                "coords": [
                    140.8,
                    76.7
                ],
                "port_name": "остров Котельный",
                "date": "2023-01-31 00:00:00",
                "time": 10000000
            },
            {
                "port": 12,
                "coords": [
                    116.0,
                    76.75
                ],
                "port_name": "Лаптевых - 1 (центр)",
                "date": "2023-05-11 00:00:00",
                "time": 10000000
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2023-08-19 00:00:00",
                "time": 10000000
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2023-11-27 00:00:00",
                "time": 10000000
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2024-03-06 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2024-06-14 00:00:00",
                "time": 10000000
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2024-06-14 09:04:26",
                "time": 9.073914774999993
            },
            {
                "port": 4,
                "coords": [
                    44.0,
                    73.0
                ],
                "port_name": "Штокман",
                "date": "2024-06-15 03:38:44",
                "time": 18.571925531250006
            }
        ],
        "speed": 16,
        "date": "06-04-2022"
    },
    {
        "name": "СЕВЕРНЫЙ ПРОЕКТ",
        "route": [
            {
                "port": 25,
                "coords": [
                    72.15,
                    71.3
                ],
                "port_name": "Сабетта",
                "date": "20-04-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-07-29 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-11-06 00:00:00",
                "time": 10000000
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-11-06 09:04:26",
                "time": 9.073914774999993
            },
            {
                "port": 5,
                "coords": [
                    22.0,
                    71.5
                ],
                "port_name": "Окно в Европу",
                "date": "2022-11-08 02:02:01",
                "time": 40.959733587499926
            }
        ],
        "speed": 16,
        "date": "20-04-2022"
    },
    {
        "name": "НИКОЛАЙ ЧУДОТВОРЕЦ",
        "route": [
            {
                "port": 25,
                "coords": [
                    72.15,
                    71.3
                ],
                "port_name": "Сабетта",
                "date": "23-04-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-08-01 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-11-09 00:00:00",
                "time": 10000000
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-11-09 09:04:26",
                "time": 9.073914774999993
            },
            {
                "port": 5,
                "coords": [
                    22.0,
                    71.5
                ],
                "port_name": "Окно в Европу",
                "date": "2022-11-11 02:02:01",
                "time": 40.959733587499926
            }
        ],
        "speed": 16,
        "date": "23-04-2022"
    },
    {
        "name": "БЕРИНГ",
        "route": [
            {
                "port": 5,
                "coords": [
                    22.0,
                    71.5
                ],
                "port_name": "Окно в Европу",
                "date": "22-04-2022",
                "time": 0
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-04-23 16:57:35",
                "time": 40.959733587499926
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-04-24 02:02:01",
                "time": 9.073914774999993
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-08-02 02:02:01",
                "time": 10000000
            },
            {
                "port": 35,
                "coords": [
                    73.73,
                    71.0
                ],
                "port_name": "Терминал Утренний",
                "date": "2022-11-10 02:02:01",
                "time": 10000000
            }
        ],
        "speed": 16,
        "date": "22-04-2022"
    },
    {
        "name": "ТОЛБУХИН",
        "route": [
            {
                "port": 41,
                "coords": [
                    33.75,
                    69.5
                ],
                "port_name": "Рейд Мурманска",
                "date": "23-04-2022",
                "time": 0
            },
            {
                "port": 2,
                "coords": [
                    44.6,
                    69.9
                ],
                "port_name": "кромка льда на Западе",
                "date": "2022-04-23 14:12:06",
                "time": 14.201683149999983
            },
            {
                "port": 15,
                "coords": [
                    57.8,
                    70.3
                ],
                "port_name": "Карские ворота",
                "date": "2022-04-24 07:06:49",
                "time": 16.912007306249997
            },
            {
                "port": 13,
                "coords": [
                    76.7,
                    74.0
                ],
                "port_name": "Карское - 1 (сбор каравана)",
                "date": "2022-08-02 07:06:49",
                "time": 10000000
            },
            {
                "port": 0,
                "coords": [
                    80.0,
                    73.1
                ],
                "port_name": "Бухта Север и Диксон",
                "date": "2022-11-10 07:06:49",
                "time": 10000000
            },
            {
                "port": 1,
                "coords": [
                    86.15,
                    69.4
                ],
                "port_name": "Дудинка",
                "date": "2023-02-18 07:06:49",
                "time": 10000000
            }
        ],
        "speed": 16,
        "date": "23-04-2022"
    },
    {
        "name": "ЯМАЛ КРЕЧЕТ",
        "route": [
            {
                "port": 4,
                "coords": [
                    44.0,
                    73.0
                ],
                "port_name": "Штокман",
                "date": "25-04-2022",
                "time": 0
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-04-25 18:34:18",
                "time": 18.571925531250006
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-04-26 03:38:44",
                "time": 9.073914774999993
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-08-04 03:38:44",
                "time": 10000000
            },
            {
                "port": 11,
                "coords": [
                    73.7,
                    68.5
                ],
                "port_name": "Новый порт",
                "date": "2022-11-12 03:38:44",
                "time": 10000000
            }
        ],
        "speed": 16,
        "date": "25-04-2022"
    },
    {
        "name": "CLEAN VISION",
        "route": [
            {
                "port": 4,
                "coords": [
                    44.0,
                    73.0
                ],
                "port_name": "Штокман",
                "date": "27-04-2022",
                "time": 0
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-04-27 21:13:30",
                "time": 21.22505775000001
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-04-28 07:35:42",
                "time": 10.370188314285707
            },
            {
                "port": 20,
                "coords": [
                    99.5,
                    77.7
                ],
                "port_name": "пролив Вилькицкого - запад",
                "date": "2022-08-06 07:35:42",
                "time": 10000000
            },
            {
                "port": 19,
                "coords": [
                    104.1,
                    77.8
                ],
                "port_name": "пролив Вилькицкого - восток",
                "date": "2022-11-14 07:35:42",
                "time": 10000000
            },
            {
                "port": 8,
                "coords": [
                    107.7,
                    77.6
                ],
                "port_name": "пролив Вилькицкого - 3",
                "date": "2023-02-22 07:35:42",
                "time": 10000000
            },
            {
                "port": 9,
                "coords": [
                    116.7,
                    74.9
                ],
                "port_name": "Лаптевых - 4 (юг)",
                "date": "2023-06-02 07:35:42",
                "time": 10000000
            },
            {
                "port": 24,
                "coords": [
                    128.1,
                    74.0
                ],
                "port_name": "устье Лены",
                "date": "2023-09-10 07:35:42",
                "time": 10000000
            }
        ],
        "speed": 14,
        "date": "27-04-2022"
    },
    {
        "name": "YAMAL SPIRIT",
        "route": [
            {
                "port": 25,
                "coords": [
                    72.15,
                    71.3
                ],
                "port_name": "Сабетта",
                "date": "27-04-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-08-05 00:00:00",
                "time": 10000000
            },
            {
                "port": 15,
                "coords": [
                    57.8,
                    70.3
                ],
                "port_name": "Карские ворота",
                "date": "2022-11-13 00:00:00",
                "time": 10000000
            },
            {
                "port": 2,
                "coords": [
                    44.6,
                    69.9
                ],
                "port_name": "кромка льда на Западе",
                "date": "2022-11-13 19:19:40",
                "time": 19.328008349999998
            },
            {
                "port": 29,
                "coords": [
                    40.05,
                    64.95
                ],
                "port_name": "Архангельск",
                "date": "2022-11-14 17:50:58",
                "time": 22.521768771428587
            }
        ],
        "speed": 14,
        "date": "27-04-2022"
    },
    {
        "name": "ТИКСИ",
        "route": [
            {
                "port": 11,
                "coords": [
                    73.7,
                    68.5
                ],
                "port_name": "Новый порт",
                "date": "25-04-2022",
                "time": 0
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-08-03 00:00:00",
                "time": 10000000
            },
            {
                "port": 16,
                "coords": [
                    67.7,
                    77.3
                ],
                "port_name": "Мыс Желания",
                "date": "2022-11-11 00:00:00",
                "time": 10000000
            },
            {
                "port": 21,
                "coords": [
                    58.3,
                    76.2
                ],
                "port_name": "около Новой Земли",
                "date": "2022-11-11 09:04:26",
                "time": 9.073914774999993
            },
            {
                "port": 5,
                "coords": [
                    22.0,
                    71.5
                ],
                "port_name": "Окно в Европу",
                "date": "2022-11-13 02:02:01",
                "time": 40.959733587499926
            }
        ],
        "speed": 16,
        "date": "25-04-2022"
    },
    {
        "name": "ТАЙБОЛА",
        "route": [
            {
                "port": 41,
                "coords": [
                    33.75,
                    69.5
                ],
                "port_name": "Рейд Мурманска",
                "date": "30-04-2022",
                "time": 0
            },
            {
                "port": 2,
                "coords": [
                    44.6,
                    69.9
                ],
                "port_name": "кромка льда на Западе",
                "date": "2022-04-30 14:12:06",
                "time": 14.201683149999983
            },
            {
                "port": 15,
                "coords": [
                    57.8,
                    70.3
                ],
                "port_name": "Карские ворота",
                "date": "2022-05-01 07:06:49",
                "time": 16.912007306249997
            },
            {
                "port": 10,
                "coords": [
                    72.7,
                    73.1
                ],
                "port_name": "Вход в Обскую губу",
                "date": "2022-08-09 07:06:49",
                "time": 10000000
            },
            {
                "port": 11,
                "coords": [
                    73.7,
                    68.5
                ],
                "port_name": "Новый порт",
                "date": "2022-11-17 07:06:49",
                "time": 10000000
            }
        ],
        "speed": 16,
        "date": "30-04-2022"
    }
]
'''
# Загрузка данных из JSON-строки
ships_data = json.loads(json_data)

def sort_ships_by_arrival_and_port(ships_data):
    all_routes = []
    for ship in ships_data:
        for route in ship['route']:
            date_format = "%Y-%m-%d %H:%M:%S" if ' ' in route['date'] else "%d-%m-%Y"
            arrival_date = datetime.strptime(route['date'], date_format)
            all_routes.append((arrival_date, ship['name'], route['port'], route['port_name']))
    all_routes.sort()
    return all_routes

def print_sorted_routes(sorted_routes):
    previous_date = None
    for route in sorted_routes:
        date_str = route[0].strftime("%d-%m-%Y")
        if date_str != previous_date:
            if previous_date is not None:
                print("————————————————————————————————————————————————————————————————————————————————")
            previous_date = date_str
        print(f"Дата: {date_str}, Корабль: {route[1]}, Порт: {route[3]}")

# Основная логика
sorted_routes = sort_ships_by_arrival_and_port(ships_data)
print_sorted_routes(sorted_routes)
